<?php

return [

    'user_role' => [
        'user'  => '注册用户',
        'seller'  => '店铺卖家',
        'admin' => '超级管理员',
    ],

    'user_status' => [
        '0' => '未激活',
        '1' => '已激活',
        '2' => '已禁言',
        '3' => '已删除',
    ],

    'password' => [
        'email'  => 'emails.password',
        'table'  => 'password_resets',
        'expire' => 60,
    ],

    //现货 -- 品种
    'goods_variety' => [
        '0'  => '1',
        '1'  => '2',
        '2'  => '3',
    ],

    //现货 -- 标准
    'goods_standard' => [
        '0'  => '标准1',
        '1'  => '标准2',
        '2'  => '标准3',
    ],

    //现货 -- 材质
    'goods_material' => [
        '0'  => '材质1',
        '1'  => '材质2',
        '2'  => '材质3',
    ],

    //现货 -- 钢厂
    'goods_steelmill' => [
    '0'  => '钢厂1',
    '1'  => '钢厂2',
    '2'  => '钢厂3',
    ],

    //现货 -- 外径 --- 左范围
    'goods_outer_diameter1' => [
        '0'  => '外径1',
        '1'  => '外径2',
        '2'  => '外径3',
    ],

    //现货 -- 外径 --- 右范围
    'goods_outer_diameter2' => [
        '0'  => '外径4',
        '1'  => '外径5',
        '2'  => '外径6',
    ],

    //现货 -- 厚度 --- 左范围
    'goods_thickness1' => [
        '0'  => '厚度1',
        '1'  => '厚度2',
        '2'  => '厚度3',
    ],

    //现货 -- 厚度 --- 右范围
    'goods_thickness2' => [
        '0'  => '厚度4',
        '1'  => '厚度5',
        '2'  => '厚度6',
    ],

    //现货 -- 长度 --- 左范围
    'goods_length1' => [
        '0'  => '1',
        '1'  => '2',
        '2'  => '3',
    ],

    //现货 -- 长度 --- 右范围
    'goods_length2' => [
        '0'  => '4',
        '1'  => '5',
        '2'  => '6',
    ],

    //现货 -- 价格 --- 左范围
    'goods_price1' => [
        '0'  => '价格1',
        '1'  => '价格2',
        '2'  => '价格3',
    ],

    //现货 -- 价格 --- 右范围
    'goods_price2' => [
        '0'  => '价格4',
        '1'  => '价格5',
        '2'  => '价格6',
    ],

    //现货 -- 价格
    'goods_price' => [
        '0'  => '1000',
        '1'  => '2000',
        '2'  => '3000',
    ],

];
